
//класс, определяющий направление

class Direction() {
    val directions1 = listOf(
        "Самара",
        "Воронеж",
        "Пермь",
        "Краснодар",
        "Астана",
        "Нижний Новгород",
        "Санкт-Петербург",
        "Москва",
        "Рязань",
        "Тула",
        "Саратов",
        "Саранск",
        "Уфа",
        "Новосибирск",
        "Екатеринбург"
    )
    val directions2 = listOf(
        "Сочи",
        "Якутск",
        "Магнитогорск",
        "Пятигорск",
        "Калуга",
        "Нижний Тагил",
        "Архангельск",
        "Владикавказ",
        "Химки",
        "Таганрог",
        "Люберцы",
        "Тамбов",
        "Благовещенск",
        "Петрозаводск",
        "Братск"
    )
    val randomCity1 = directions1.random()
    val randomCity2 = directions2.random()
    val direction = "$randomCity1 - $randomCity2"


}